000000161104       PROCESS APOST.
000000161104      ****************************************************************
000000161104      *                                                              *
000000161104      *    PROGRAMME: PRO201                                         *
000000161104      *                                                              *
000000161104      *                                                              *
000000161104      ****************************************************************
000000161104
000000161104       IDENTIFICATION DIVISION.
000000161104      *************************
000000161104
000000161104       PROGRAM-ID. PRO201.
000000161104       AUTHOR. FORUM AS/400.
000000161104
000000161104       ENVIRONMENT DIVISION.
000000161104      **********************
000000161104
000000161104       CONFIGURATION SECTION.
000000161104      *---------------------*
000000161104       SOURCE-COMPUTER. IBM-AS400.
000000161104       OBJECT-COMPUTER. IBM-AS400.
000000161104
000000161104       INPUT-OUTPUT SECTION.
000000161104      *--------------------*
000000161104       FILE-CONTROL.
000000161104
000000161104           SELECT PROVIDE1 ASSIGN DATABASE-PROVIDE1
000000161104                             ORGANIZATION INDEXED
000000161104                             ACCESS MODE  SEQUENTIAL
000000161104                             RECORD KEY   EXTERNALLY-DESCRIBED-KEY.
000000161104
000000161104           SELECT PRO201D  ASSIGN WORKSTATION-PRO201D
000000161104                           ORGANIZATION TRANSACTION
000000161104                           ACCESS       DYNAMIC
000000161104                           RELATIVE KEY RRN01
000000161104                           FILE STATUS IS A
000000161104                           CONTROL-AREA F-KEYS.
000000161104
000000161104       DATA DIVISION.
000000161104      ***************
000000161104
000000161104       FILE SECTION.
000000161104      *------------*
000000161104
000000161104       FD  PROVIDE1.
000000161104       01  PRO-REC.
000000161104           COPY DDS-FPROV IN PROVIDE1.
000000161104
000000161104       FD  PRO201D.
000000161104       01  PRO201D-REC         PIC X(366).
000000161104
000000161104       WORKING-STORAGE SECTION.
000000161104      *-----------------------*
000000161104
000000161104       01  CTL01-OUT.
000000161104           COPY DDS-CTL01-O    IN PRO201D.
000000161104       01  CTL01-IN.
000000161104           COPY DDS-CTL01-I    IN PRO201D.
000000161104
000000161104       01  SFL01-OUT.
000000161104           COPY DDS-SFL01-O    IN PRO201D.
000000161104       01  SFL01-IN.
000000161104           COPY DDS-SFL01-I    IN PRO201D.
000000161104
000000161104       01  FMT02-OUT.
000000161104           COPY DDS-FMT02-O    IN PRO201D.
000000161104       01  FMT02-IN.
000000161104           COPY DDS-FMT02-I    IN PRO201D.
000000161104
000000161104       01  PRID-WRK            LIKE PRID IN PRO-REC.
000000161104
000000161104       01  F-KEYS.
000000161104           05 F             PIC XX.
000000161104              88 F3         VALUE '03'.
000000161104              88 F12        VALUE '12'.
000000161104      *    ATTENTION PAGEDOWN = 90 AND PAGEUP = 91 ALWAYS !
000000161104              88 PAGEDOWN   VALUE '90'.
000000161104
000000161104       01  END-OF-FILE          PIC X.
000000161104              88 EOF            VALUE 'E'.
000000161104              88 NOF            VALUE 'N'.
000000161104
000000161104       01  IND-ON           PIC 1       VALUE B'1'.
000000161104       01  IND-OFF          PIC 1       VALUE B'0'.
000000161104
000000161104       01  A PIC XX.
000000161104
000000161104       01  PANEL          PIC 9(2)    COMP-3    VALUE 1 .
000000161104       01  RRN01          PIC 9(4)    COMP-3.
000000161104       01  SAVRRN01       PIC 9(4)    COMP-3.
000000161104       01  SFLPAG         PIC 9(2)    COMP-3    VALUE 14.
000000161104       01  STEP01         PIC X.
000000161104       01  STEP02         PIC X.
000000161104       01  TELLER         PIC 9(3)    COMP-3.
000000161104
000000161104      * VARIABLES TO IDENTIFY THE PANEL STEP
000000161104       01  PRP              PIC X       VALUE 'P'.
000000161104       01  DSP              PIC X       VALUE 'D'.
000000161104       01  FKEY             PIC X       VALUE 'F'.
000000161104       01  CHK              PIC X       VALUE 'C'.
000000161104       01  ACT              PIC X       VALUE 'A'.
000000161104       01  LOAD             PIC X       VALUE 'L'.
000000161104
000000161104       PROCEDURE DIVISION.
000000161104      ********************
000000161104
000000161104        PRO201.
000000161104           PERFORM PGM-INIT
000000161104
000000161104           PERFORM UNTIL PANEL = 0
000000161104             EVALUATE PANEL
000000161104               WHEN 01
000000161104                 PERFORM PNL01
000000161104               WHEN 02
000000161104                 PERFORM PNL02
000000161104
000000161104
000000161104               WHEN OTHER
000000161104                 PERFORM PGM-END
000000161104             END-EVALUATE
000000161104           END-PERFORM
000000161104
000000161104           PERFORM PGM-END.
000000161104
000000161104
000000161104       PNL01.
000000161104
000000161104           EVALUATE STEP01
000000161104             WHEN PRP
000000161104               PERFORM PRP01
000000161104             WHEN LOAD
000000161104               PERFORM LOD01
000000161104             WHEN DSP
000000161104               PERFORM DSP01
000000161104             WHEN FKEY
000000161104               PERFORM FKEY01
000000161104             WHEN CHK
000000161104               PERFORM CHK01
000000161104             WHEN ACT
000000161104               PERFORM ACT01
000000161104           END-EVALUATE.
000000161104
000000161104      * PREPARE SUBFILE --------------------
000000161104       PRP01.
000000161104           MOVE IND-ON TO IN30
000000161104           MOVE IND-OFF TO IN31
000000161104           WRITE PRO201D-REC FROM CTL01-O FORMAT IS 'CTL01'
000000161104           END-WRITE
000000161104           MOVE IND-OFF TO IN30
000000161104           MOVE ZERO TO SAVRRN01
000000161104
000000161104
000000161104             READ PROVIDE1
000000161104                  AT END MOVE IND-ON TO IN80
000000161104             END-READ
000000161104             MOVE LOAD TO STEP01
000000161104
000000161104
000000161104      * LOAD SUBFILE   ---------------------
000000161104       LOD01.
000000161104           MOVE SAVRRN01 TO RRN01
000000161104           COMPUTE RRB01 IN CTL01-O = RRN01 + 1
000000161104           MOVE 0 TO TELLER
000000161104           MOVE 0 TO OPT01 IN SFL01-O
000000161104           PERFORM UNTIL IN80 = IND-ON
000000161104                         OR TELLER >= SFLPAG
000000161104               ADD 1 TO RRN01
000000161104               ADD 1 TO TELLER
000000161104               MOVE CORR FPROV    TO SFL01-O
000000161104               WRITE SUBFILE PRO201D-REC FROM SFL01-O
000000161104                             FORMAT IS 'SFL01'
000000161104               READ PROVIDE1
000000161104                    AT END MOVE IND-ON TO IN80
000000161104               END-READ
000000161104           END-PERFORM
000000161104           MOVE RRN01 TO SAVRRN01
000000161104           MOVE DSP TO STEP01
000000161104
000000161104      * DISPLAY PANEL  ---------------------
000000161104       DSP01.
000000161104
000000161104           IF SAVRRN01 = ZERO
000000161104              MOVE IND-OFF TO IN31
000000161104           ELSE
000000161104              MOVE IND-ON  TO IN31
000000161104           END-IF
000000161104           MOVE IND-ON  TO IN32
000000161104
000000161104           WRITE PRO201D-REC FORMAT IS 'KEY01'
000000161104           WRITE PRO201D-REC FROM CTL01-O FORMAT IS 'CTL01'
000000161104           READ PRO201D INTO CTL01-I FORMAT IS 'CTL01'
000000161104           MOVE IND-OFF TO IN35
000000161104           MOVE FKEY TO STEP01
000000161104
000000161104      * COMMAND KEYS (EXCEPT CONFIRMATION) ----
000000161104       FKEY01.
000000161104           EVALUATE TRUE
000000161104             WHEN F3
000000161104               MOVE 0   TO PANEL
000000161104               MOVE PRP TO STEP01
000000161104             WHEN F12
000000161104               SUBTRACT 1 FROM PANEL
000000161104               MOVE PRP TO STEP01
000000161104             WHEN PAGEDOWN
000000161104               MOVE LOAD TO STEP01
000000161104             WHEN OTHER
000000161104               MOVE CHK TO STEP01
000000161104           END-EVALUATE.
000000161104
000000161104      * CHECK DISPLAY  ---------------------
000000161104       CHK01.
000000161104           MOVE ACT TO STEP01
000000161104           MOVE IND-ON TO IN33
000000161104           READ SUBFILE PRO201D NEXT MODIFIED
000000161104                               INTO SFL01-I FORMAT IS 'SFL01'
000000161104                 AT END SET EOF TO TRUE
000000161104                 NOT AT END SET NOF TO TRUE
000000161104           END-READ
000000161104           PERFORM UNTIL EOF
000000161104             MOVE CORR SFL01-I TO SFL01-O
000000161104             IF OPT01 IN SFL01-I  NOT = 0
000000161104                  AND OPT01 IN SFL01-I NOT = 2
000000161104                  AND OPT01 IN SFL01-I NOT = 5
000000161104                MOVE IND-ON TO IN35 , IN34
000000161104                MOVE DSP TO STEP01
000000161104             END-IF
000000161104             REWRITE SUBFILE PRO201D-REC FROM SFL01-O
000000161104                  FORMAT IS 'SFL01'
000000161104             MOVE IND-OFF TO IN34
000000161104             READ SUBFILE PRO201D NEXT MODIFIED
000000161104                                 INTO SFL01-I FORMAT IS 'SFL01'
000000161104                   AT END SET EOF TO TRUE
000000161104                   NOT AT END SET NOF TO TRUE
000000161104             END-READ
000000161104           END-PERFORM
000000161104           MOVE IND-OFF TO IN33
000000161104      * PERFORM ACTION ---------------------
000000161104       ACT01.
000000161104             READ SUBFILE PRO201D NEXT MODIFIED
000000161104                                 INTO SFL01-I FORMAT IS 'SFL01'
000000161104                   AT END SET EOF TO TRUE
000000161104                   NOT AT END SET NOF TO TRUE
000000161104             END-READ
000000161104             IF NOF
000000161104                IF OPT01 IN SFL01-I = 2
000000161104                   MOVE 2   TO PANEL
000000161104                   MOVE CORR SFL01-I TO SFL01-O
000000161104                   MOVE 0   TO OPT01 IN SFL01-O
000000161104                   REWRITE SUBFILE PRO201D-REC FROM SFL01-O
000000161104                       FORMAT IS 'SFL01'
000000161104
000000161104                END-IF
000000161104                IF OPT01 IN SFL01-I = 5
000000161104                   MOVE PRID IN SFL01-I TO PRID-WRK
000000161104                   CALL "ART202" USING  PRID-WRK
000000161104                   MOVE CORR SFL01-I TO SFL01-O
000000161104                   MOVE 0   TO OPT01 IN SFL01-O
000000161104                   REWRITE SUBFILE PRO201D-REC FROM SFL01-O
000000161104                       FORMAT IS 'SFL01'
000000161104                END-IF
000000161104             ELSE
000000161104                MOVE DSP TO STEP01
000000161104             END-IF.
000000161104
000000161104       PNL02.
000000161104
000000161104             EVALUATE STEP02
000000161104               WHEN PRP
000000161104                 PERFORM PRP02
000000161104               WHEN DSP
000000161104                 PERFORM DSP02
000000161104               WHEN FKEY
000000161104                 PERFORM FKEY02
000000161104           END-EVALUATE.
000000161104
000000161104      * PREPARE PANEL 02 ---------------------
000000161104       PRP02.
000000161104           MOVE CORRESPONDING SFL01-I TO FMT02-O
000000161104           MOVE DSP TO STEP02
000000161104
000000161104      * DISPLAY PANEL 02 ---------------------
000000161104       DSP02.
000000161104
000000161104           WRITE PRO201D-REC FROM FMT02-O FORMAT IS 'FMT02'
000000161104           READ PRO201D INTO FMT02-I FORMAT IS 'FMT02'
000000161104           MOVE FKEY TO STEP02
000000161104
000000161104      * COMMAND KEYS (EXCEPT CONFIRMATION) 02 ----
000000161104       FKEY02.
000000161104             EVALUATE TRUE
000000161104               WHEN F3
000000161104                 MOVE 1   TO PANEL
000000161104                 MOVE PRP TO STEP02
000000161104                 MOVE PRP TO STEP01
000000161104               WHEN F12
000000161104                 SUBTRACT 1 FROM PANEL
000000161104                 MOVE PRP TO STEP02
000000161104                 MOVE DSP TO STEP01
000000161104               WHEN OTHER
000000161104                 SUBTRACT 1 FROM PANEL
000000161104                 MOVE PRP TO STEP02
000000161104           END-EVALUATE.
000000161104
000000161104        PGM-INIT.
000000161104           MOVE 1    TO PANEL
000000161104           MOVE PRP  TO STEP01
000000161104           MOVE PRP  TO STEP02
000000161104           OPEN INPUT PROVIDE1
000000161104                I-O   PRO201D.
000000161104
000000161104        PGM-END.
000000161104           CLOSE  PRO201D PROVIDE1
000000161104           STOP RUN.
