000000161104     FCOU200D CF  E                    WORKSTN      KINFDS INFDS
000000161104     F                                        RRN01 KSFILE SFL01
000000161104      *
000000161104     FCOUNTRY UF  E           K        DISK
000000161104      * SCREEN INFORMATION DS.
000000161104     IINFDS       DS
000000161104     I                                    B 378 3790LRRN
000000161104      *
000000161104     C           LOOP      TAG
000000161104     C           PANEL     CASEQ1         PNL01
000000161104     C           PANEL     CASEQ2         PNL02
000000161104     C                     ENDCS
000000161104     C           PANEL     CABEQ0         ENDPGM
000000161104     C                     GOTO LOOP
000000161104     C           ENDPGM    TAG
000000161104     C                     SETON                     LR
000000161104      *
000000161104     C           PNL01     BEGSR
000000161104     C           STEP01    CASEQ'PRP'     S01PRP
000000161104     C           STEP01    CASEQ'LOD'     S01LOD
000000161104     C           STEP01    CASEQ'DSP'     S01DSP
000000161104     C           STEP01    CASEQ'KEY'     S01KEY
000000161104     C           STEP01    CASEQ'CHK'     S01CHK
000000161104     C           STEP01    CASEQ'ACT'     S01ACT
000000161104     C                     ENDCS
000000161104     C                     ENDSR
000000161104     C           S01PRP    BEGSR
000000161104     C                     Z-ADD0         RRN01   40
000000161104     C                     SETON                     30
000000161104     C                     WRITECTL01
000000161104     C                     SETOF                     30
000000161104     C                     MOVE 'LOD'     STEP01
000000161104     C                     ENDSR
000000161104     C           S01LOD    BEGSR
000000161104     C           RRN01     ADD  1         RRB01
000000161104     C           *LOVAL    SETLLCOUNTRY
000000161104     C                     READ COUNTRY             N    80
000000161104     C           *IN80     DOWEQ*OFF
000000161104     C                     ADD  1         RRN01
000000161104     C                     WRITESFL01
000000161104     C                     READ COUNTRY             N    80
000000161104     C                     ENDDO
000000161104     C                     MOVE 'DSP'     STEP01
000000161104     C                     ENDSR
000000161104     C           S01DSP    BEGSR
000000161104     C                     SETON                         32
000000161104     C           RRN01     COMP 0                    31
000000161104     C                     WRITEKEY01
000000161104     C                     EXFMTCTL01
000000161104     C           LRRN      IFGT 0
000000161104     C                     Z-ADDLRRN      RRB01
000000161104     C                     ENDIF
000000161104     C                     MOVE 'KEY'     STEP01
000000161104     C                     ENDSR
000000161104     C           S01KEY    BEGSR
000000161104     C                     SELEC
000000161104     C           *IN03     WHEQ *ON
000000161104     C                     Z-ADD0         PANEL
000000161104     C           *IN12     WHEQ *ON
000000161104     C                     Z-ADD0         PANEL
000000161104     C                     OTHER
000000161104     C                     MOVE 'CHK'     STEP01
000000161104     C                     ENDSL
000000161104     C                     ENDSR
000000161104     C           S01CHK    BEGSR
000000161104     C                     MOVE 'ACT'     STEP01
000000161104     C                     MOVE *OFF      ERR01   1
000000161104     C                     MOVE *ON       *IN33
000000161104     C                     READCSFL01                    99
000000161104     C           *IN99     DOWEQ*OFF
000000161104     C           OPT01     IFNE 0
000000161104     C           OPT01     ANDNE2
000000161104     C                     MOVE 'DSP'     STEP01
000000161104     C                     SETON                     3435
000000161104     C           ERR01     IFEQ *OFF
000000161104     C                     Z-ADDRRN01     RRB01
000000161104     C                     MOVE *ON       ERR01
000000161104     C                     ENDIF
000000161104     C                     ENDIF
000000161104     C                     UPDATSFL01
000000161104     C                     SETOF                     34
000000161104     C                     READCSFL01                    99
000000161104     C                     ENDDO
000000161104     C                     SETOF                     33
000000161104     C                     ENDSR
000000161104     C           S01ACT    BEGSR
000000161104     C                     READCSFL01                    99
000000161104     C                     SELEC
000000161104     C           *IN99     WHEQ *ON
000000161104     C                     MOVE 'DSP'     STEP01
000000161104     C           OPT01     WHEQ 2
000000161104     C                     Z-ADD2         PANEL
000000161104     C                     MOVE 'PRP'     STEP02
000000161104     C                     Z-ADD0         OPT01
000000161104     C                     UPDATSFL01
000000161104     C                     ENDSL
000000161104     C                     ENDSR
000000161104     C           PNL02     BEGSR
000000161104     C           STEP02    CASEQ'PRP'     S02PRP
000000161104     C           STEP02    CASEQ'DSP'     S02DSP
000000161104     C           STEP02    CASEQ'KEY'     S02KEY
000000161104     C           STEP02    CASEQ'CHK'     S02CHK
000000161104     C           STEP02    CASEQ'ACT'     S02ACT
000000161104     C                     ENDCS
000000161104     C                     ENDSR
000000161104     C           S02PRP    BEGSR
000000161104     C                     MOVE 'DSP'     STEP02
000000161104     C           COID      CHAINCOUNTRY              98
000000161104     C                     ENDSR
000000161104     C           S02DSP    BEGSR
000000161104     C                     EXFMTFMT02
000000161104     C                     MOVE 'KEY'     STEP02
000000161104     C                     ENDSR
000000161104     C           S02KEY    BEGSR
000000161104     C                     SELEC
000000161104     C           *IN03     WHEQ *ON
000000161104     C                     GOTO ENDPGM
000000161104     C           *IN12     WHEQ *ON
000000161104     C                     Z-ADD1         PANEL
000000161104     C                     OTHER
000000161104     C                     MOVE 'CHK'     STEP02
000000161104     C                     ENDSL
000000161104     C                     ENDSR
000000161104     C           S02CHK    BEGSR
000000161104     C                     MOVE 'ACT'     STEP02
000000161104     C                     ENDSR
000000161104     C           S02ACT    BEGSR
000000161104     C                     UPDATFCOUN
000000161104     C                     Z-ADD1         PANEL
000000161104     C                     ENDSR
000000161104     C           *INZSR    BEGSR
000000161104     C                     Z-ADD1         PANEL   10
000000161104     C                     MOVE 'PRP'     STEP01  3
000000161104     C                     MOVE 'PRP'     STEP02  3
000000161104     C                     ENDSR
