000000161201     A*%%TS  SD  20161201  121434  VTAQUIN     REL-V7R1M0  5770-WDS
000000161201     A*%%EC
000000161201     A                                      DSPSIZ(24 80 *DS3)
000000161201     A                                      INDARA
000000161201     A                                      CA03(03)
000000161201     A                                      CA12(12)
000000161201     A                                      PRINT
000000161201     A                                      ERRSFL
000000161104     A          R SFL01                     SFL
000000161104     A*%%TS  SD  20161104  143857  VTAQUIN     REL-V7R1M0  5770-WDS
000000161104     A  33                                  SFLNXTCHG
000000161104     A            OPT01          2Y 0B  7  3
000000161104     A  34                                  DSPATR(RI)
000000161104     A  34                                  DSPATR(PC)
000000161104     A                                      EDTCDE(Z)
000000161104     A            APREF     R        O  7 64REFFLD(FARPR/APREF *LIBL/ARTIPROV)
000000161104     A            APARID    R        O  7  6REFFLD(APARID ARTIPROV)
000000161104     A            ARDESC    R        O  7 13REFFLD(ARDESC ARTICLE)
000000161104     A            APPRICE   R        H      REFFLD(FARPR/APPRICE *LIBL/ARTIPROV)
000000161104     A          R CTL01                     SFLCTL(SFL01)
000000161104     A*%%TS  SD  20161104  143857  VTAQUIN     REL-V7R1M0  5770-WDS
000000161104     A                                      SFLSIZ(0015)
000000161104     A                                      SFLPAG(0014)
000000161104     A                                      OVERLAY
000000161104     A  31                                  SFLDSP
000000161104     A  32                                  SFLDSPCTL
000000161104     A  30                                  SFLCLR
000000161104     A  80                                  SFLEND(*MORE)
000000161104     A  35                                  SFLMSG('Invalid Option' 35)
000000161104     A            RRB01          4S 0H      SFLRCDNBR
000000161104     A                                  1  2'ART202-1'
000000161104     A                                      COLOR(BLU)
000000161104     A                                  3  4'Type options, press Enter.'
000000161104     A                                      COLOR(BLU)
000000161104     A                                  6  2'Opt'
000000161104     A                                      DSPATR(HI)
000000161104     A                                  1 27'Work with Article Providers'
000000161104     A                                      DSPATR(HI)
000000161104     A                                  1 68DATE
000000161104     A                                      EDTCDE(Y)
000000161104     A                                  2 68TIME
000000161104     A                                  4  7'2=Edit'
000000161104     A                                      COLOR(BLU)
000000161104     A                                  6 64'Reference'
000000161104     A                                      DSPATR(HI)
000000161104     A            APPRID    R        O  2  4REFFLD(FARPR/APPRID *LIBL/ARTIPROV)
000000161104     A            PROVNM    R        O  2 10REFFLD(FPROV/PROVNM *LIBL/PROVIDER)
000000161104     A                                  6  6'Article'
000000161104     A                                      DSPATR(HI)
000000161024     A          R KEY01
000000161024     A                                 23  3'F3=Exit'
000000161024     A                                      COLOR(BLU)
000000161024     A                                 23 19'F12=Cancel'
000000161024     A                                      COLOR(BLU)
000000161024
000000161025     A          R FMT02
000000161104     A*%%TS  SD  20161025  170547  VTAQUIN     REL-V7R1M0  5770-WDS
000000161025     A                                      CF04(04 'Prompt')
000000161104     A                                  1  2'ART202-2'
000000161025     A                                      COLOR(BLU)
000000161025     A                                  3  4'Type choices, press Enter.'
000000161025     A                                      COLOR(BLU)
000000161025     A                                 23  3'F3=Exit'
000000161025     A                                      COLOR(BLU)
000000161025     A                                 23 19'F12=Cancel'
000000161025     A                                      COLOR(BLU)
000000161025     A                                  1 32'ARTIPROV definition'
000000161025     A                                      DSPATR(HI)
000000161025     A                                  5  4'Article  . . . . . . . :'
000000161025     A            ARDESC    R        O  6 29REFFLD(ARDESC ARTICLE)
000000161025     A                                  9  4'Unit Price   . . . . . .'
000000161025     A                                 10  4'Provider Reference . . .'
000000161025     A                                  7  4'Provider'
000000161025     A                                  7 13'.'
000000161025     A                                  7 15'.'
000000161025     A                                  7 17'.'
000000161025     A                                  7 19'.'
000000161025     A                                  7 21'.'
000000161025     A                                  7 23'.'
000000161025     A                                  7 25'.'
000000161025     A                                  7 27':'
000000161025     A            APARID    R        O  5 29REFFLD(APARID ARTIPROV)
000000161025     A            APPRICE   R        B  9 29REFFLD(FARPR/APPRICE *LIBL/ARTIPROV)
000000161025     A                                      EDTCDE(2)
000000161025     A            APREF     R        B 10 29REFFLD(FARPR/APREF *LIBL/ARTIPROV)
000000161025     A            APPRID    R        O  7 29REFFLD(FARPR/APPRID *LIBL/ARTIPROV)
000000161025     A            PROVNM    R        O  8 29REFFLD(FPROV/PROVNM *LIBL/PROVIDER)
