000000161201     A*%%TS  SD  20161201  100943  VTAQUIN     REL-V7R1M0  5770-WDS
000000161201     A*%%EC
000000161201     A                                      DSPSIZ(24 80 *DS3)
000000161201     A                                      INDARA
000000161201     A                                      CA03(03)
000000161201     A                                      CA12(12)
000000161201     A                                      PRINT
000000161201     A                                      ERRSFL
000000161027     A          R SFL01                     SFL
000000161027     A*%%TS  SD  20161027  111456  VTAQUIN     REL-V7R1M0  5770-WDS
000000161027     A  33                                  SFLNXTCHG
000000161027     A            OPT01          2Y 0B  7  3
000000161027     A  34                                  DSPATR(RI)
000000161027     A  34                                  DSPATR(PC)
000000161027     A                                      EDTCDE(Z)
000000161027     A            ARID      R        O  7  7REFFLD(FARTI/ARID *LIBL/ARTICLE)
000000161027     A            ARDESC    R        O  7 14REFFLD(FARTI/ARDESC *LIBL/ARTICLE)
000000161027     A            ARTIFA    R        O  7 65REFFLD(FARTI/ARTIFA *LIBL/ARTICLE)
000000161027     A            ARDEL     R        O  7 70REFFLD(FARTI/ARDEL *LIBL/ARTICLE)
000000161201     A          R CTL01                     SFLCTL(SFL01)
000000161201     A*%%TS  SD  20161201  100943  VTAQUIN     REL-V7R1M0  5770-WDS
000000161201     A                                      SFLSIZ(0015)
000000161201     A                                      SFLPAG(0014)
000000161201     A N80                                  PAGEDOWN(25 'dynamic subfile')
000000161201     A                                      CF06(06 'Create')
000000161201     A                                      OVERLAY
000000161201     A  31                                  SFLDSP
000000161201     A  32                                  SFLDSPCTL
000000161201     A  30                                  SFLCLR
000000161201     A  80                                  SFLEND(*MORE)
000000161201     A  35                                  SFLMSG('Invalid Option' 35)
000000161201     A            RRB01          4S 0H      SFLRCDNBR
000000161201     A                                  1  2'ART200-1'
000000161201     A                                      COLOR(BLU)
000000161201     A                                  3  4'Type options, press Enter.'
000000161201     A                                      COLOR(BLU)
000000161201     A                                  6  2'Opt'
000000161201     A                                      DSPATR(HI)
000000161201     A                                  1 32'Work with Articles'
000000161201     A                                      DSPATR(HI)
000000161201     A                                  1 68DATE
000000161201     A                                      EDTCDE(Y)
000000161201     A                                  2 68TIME
000000161201     A                                  4  7'2=Edit'
000000161201     A                                      COLOR(BLU)
000000161201     A                                  4 17'3=Info'
000000161201     A                                      COLOR(BLU)
000000161201     A                                  4 39'6=Suppliers'
000000161201     A                                      COLOR(BLU)
000000161201     A                                  4 26'4=Delete'
000000161201     A                                      COLOR(BLU)
000000161201     A                                  6  7'Id'
000000161201     A                                      DSPATR(HI)
000000161201     A                                  6 14'Description'
000000161201     A                                      DSPATR(HI)
000000161201     A                                  6 65'Fam'
000000161201     A                                      DSPATR(HI)
000000161201     A                                  6 69'Del'
000000161201     A                                      DSPATR(HI)
000000161201     A                                  2  4'Position to . . .'
000000161201     A            POSTO         10A  B  2 23CHECK(LC)
000000161027     A          R KEY01
000000161027     A*%%TS  SD  20161027  111559  VTAQUIN     REL-V7R1M0  5770-WDS
000000161027     A                                 23  3'F3=Exit'
000000161027     A                                      COLOR(BLU)
000000161027     A                                 23 33'F12=Cancel'
000000161027     A                                      COLOR(BLU)
000000161027     A                                 23 16'F6=Create'
000000161027     A                                      COLOR(BLU)
000000161103     A          R FMT02
000000161103     A*%%TS  SD  20161103  154035  VTAQUIN     REL-V7R1M0  5770-WDS
000000161103     A                                      CF04(04 'Prompt')
000000161103     A                                  1  2'ART200-2'
000000161103     A                                      COLOR(BLU)
000000161103     A                                  3  4'Type choices, press Enter.'
000000161103     A                                      COLOR(BLU)
000000161103     A                                 23  3'F3=Exit'
000000161103     A                                      COLOR(BLU)
000000161103     A                                 23 36'F12=Cancel'
000000161103     A                                      COLOR(BLU)
000000161103     A                                  1 32'Article definition'
000000161103     A                                      DSPATR(HI)
000000161103     A                                  5  4'Article id . . . . . . :'
000000161103     A            ARID      R        O  5 29REFFLD(FARTI/ARID *LIBL/ARTICLE)
000000161103     A                                  6  4'Description  . . . . . .'
000000161103     A            ARDESC    R        B  6 29REFFLD(FARTI/ARDESC *LIBL/ARTICLE)
000000161103     A  41                                  ERRMSG('A description is mandatory'-
000000161103     A                                       41)
000000161103     A                                      CHECK(LC)
000000161103     A                                  7  4'Familly. . . . . . . . .'
000000161103     A                                  9  4'Reference sale price . .'
000000161103     A                                 11  4'Stock price  . . . . . .'
000000161103     A                                 12  4'Minimum stock  . . . . .'
000000161103     A            ARTIFA    R        B  7 29REFFLD(FARTI/ARTIFA *LIBL/ARTICLE)
000000161103     A  40                                  ERRMSGID(ERR0001 *LIBL/SAMMSGF 40)
000000161103     A            ARSALEPR  R        B  9 29REFFLD(FARTI/ARSALEPR *LIBL/ARTICLE)
000000161103     A            ARWHSPR   R        B 11 29REFFLD(FARTI/ARWHSPR *LIBL/ARTICLE)
000000161103     A            ARSTOCK   R        B 13 29REFFLD(FARTI/ARSTOCK *LIBL/ARTICLE)
000000161103     A                                 13  4'Stock  . . . . . . . . .'
000000161103     A            ARMINQTY  R        B 12 29REFFLD(FARTI/ARMINQTY *LIBL/ARTICLE)
000000161103     A            FAMDESC       30A  O  7 34
000000161103     A                                 23 15'F4=Prompt'
000000161103     A                                      COLOR(BLU)
000000161103     A                                  8  4'VAT code . . . . . . . .'
000000161103     A                                 10  9'with VAT  . . . . :'
000000161103     A            WITHVAT   R        O 10 29REFFLD(FARTI/ARSALEPR *LIBL/ARTICLE)
000000161103     A                                      EDTCDE(2)
000000161103     A            ARVATCD   R        B  8 29REFFLD(FARTI/ARVATCD *LIBL/ARTICLE)
000000161103     A            VATRATE   R        O  8 31REFFLD(FVAT/VATRATE *LIBL/VATDEF)
000000161103     A                                      EDTCDE(2)
000000161103     A                                  8 37'%'
000000161103     A            VATDESC   R        O  8 40REFFLD(FVAT/VATDESC *LIBL/VATDEF)
000000161027     A          R FMT03
000000161027     A*%%TS  SD  20161027  114842  VTAQUIN     REL-V7R1M0  5770-WDS
000000161027     A                                  1  2'ART200-3'
000000161027     A                                      COLOR(BLU)
000000161027     A                                  3  4' Make change. Press Enter to confi-
000000161027     A                                      rm'
000000161027     A                                      COLOR(BLU)
000000161027     A                                 23  3' F3Exit'
000000161027     A                                      COLOR(BLU)
000000161027     A                                 23 19' F12Cancel'
000000161027     A                                      COLOR(BLU)
000000161027     A                                  1 31'Article Informations'
000000161027     A                                      DSPATR(HI)
000000161027     A            ARID      R        O  2  4REFFLD(FARTI/ARID *LIBL/ARTICLE)
000000161027     A                                  1 69DATE
000000161027     A                                      EDTCDE(Y)
000000161027     A            ARDESC    R        O  2 11REFFLD(FARTI/ARDESC *LIBL/ARTICLE)
000000161027     A                                  2 69TIME
000000161027     A            TEXT        1520A  B  4  1CHECK(LC)
