000000161104     A*%%TS  SD  20161104  162149  VTAQUIN     REL-V7R1M0  5770-WDS
000000161104     A*%%EC
000000161104     A                                      DSPSIZ(24 80 *DS3)
000000161104     A                                      INDARA
000000161104     A                                      CA03(03)
000000161104     A                                      CA12(12)
000000161104     A                                      PRINT
000000161104     A                                      ERRSFL
000000161104     A          R SFL01                     SFL
000000161104     A*%%TS  SD  20161104  162149  VTAQUIN     REL-V7R1M0  5770-WDS
000000161104     A  33                                  SFLNXTCHG
000000161104     A            OPT01          2Y 0B  7  3
000000161104     A  34                                  DSPATR(RI)
000000161104     A  34                                  DSPATR(PC)
000000161104     A                                      EDTCDE(Z)
000000161104     A            COID      R        O  7  7REFFLD(FCOUN/COID *LIBL/COUNTRY)
000000161104     A            COUNTR    R        O  7 10REFFLD(FCOUN/COUNTR *LIBL/COUNTRY)
000000161104     A            COISO     R        O  7 41REFFLD(FCOUN/COISO *LIBL/COUNTRY)
000000161104     A          R CTL01                     SFLCTL(SFL01)
000000161104     A*%%TS  SD  20161104  162149  VTAQUIN     REL-V7R1M0  5770-WDS
000000161104     A                                      SFLSIZ(0015)
000000161104     A                                      SFLPAG(0014)
000000161104     A N80                                  PAGEDOWN(25 'dynamic subfile')
000000161104     A                                      OVERLAY
000000161104     A  31                                  SFLDSP
000000161104     A  32                                  SFLDSPCTL
000000161104     A  30                                  SFLCLR
000000161104     A  80                                  SFLEND(*MORE)
000000161104     A  35                                  SFLMSG('Invalid Option' 35)
000000161104     A            RRB01          4S 0H      SFLRCDNBR
000000161104     A                                  1  2'COU200 '
000000161104     A                                      COLOR(BLU)
000000161104     A                                  3  4'Type options, press Enter.'
000000161104     A                                      COLOR(BLU)
000000161104     A                                  4  6'2=Edit'
000000161104     A                                      COLOR(BLU)
000000161104     A                                  6  3'Opt'
000000161104     A                                      DSPATR(HI)
000000161104     A                                  1 31'Work with Countries'
000000161104     A                                      DSPATR(HI)
000000161104     A                                  1 66DATE
000000161104     A                                      EDTCDE(Y)
000000161104     A                                  2 66TIME
000000161104     A          R KEY01
000000161104     A                                 23  3'F3=Exit'
000000161104     A                                      COLOR(BLU)
000000161104     A                                 23 19'F12=Cancel'
000000161104     A                                      COLOR(BLU)
000000161104     A          R FMT02
000000161104     A*%%TS  SD  20161104  162149  VTAQUIN     REL-V7R1M0  5770-WDS
000000161104     A                                  1  2'COU200 '
000000161104     A                                      COLOR(BLU)
000000161104     A                                  3  4'Type choices, press Enter.'
000000161104     A                                      COLOR(BLU)
000000161104     A                                 23  3'F3=Exit'
000000161104     A                                      COLOR(BLU)
000000161104     A                                 23 19'F12=Cancel'
000000161104     A                                      COLOR(BLU)
000000161104     A                                  6  4'Country Name . . .'
000000161104     A                                  5  4'Country Code . . :'
000000161104     A                                  7  4'Iso Code (3) . . .'
000000161104     A                                  1 34'Edit a country'
000000161104     A                                      DSPATR(HI)
000000161104     A                                  1 66DATE
000000161104     A                                      EDTCDE(Y)
000000161104     A                                  2 66TIME
000000161104     A            COID      R        O  5 24REFFLD(FCOUN/COID *LIBL/COUNTRY)
000000161104     A            COUNTR    R        B  6 24REFFLD(FCOUN/COUNTR *LIBL/COUNTRY)
000000161104     A                                      CHECK(LC)
000000161104     A            COISO     R        B  7 24REFFLD(FCOUN/COISO *LIBL/COUNTRY)
