000000161025     A*%%TS  SD  20161025  135749  VTAQUIN     REL-V7R1M0  5770-WDS
000000161025     A*%%EC
000000161025     A                                      DSPSIZ(24 80 *DS3)
000000161025     A                                      INDARA
000000161025     A                                      PRINT
000000161025     A                                      ERRSFL
000000161025     A                                      CA03(03)
000000161025     A                                      CA12(12)
000000161025     A          R DUMMY
000000161025     A                                      KEEP
000000161025     A                                      ASSUME
000000161025     A                                      OVERLAY
000000161025     A                                      PUTOVR
000000161025     A            FLD001         1   O 23 79
000000161025     A          R SFL01                     SFL
000000161025     A*%%TS  SD  20161025  121722  VTAQUIN     REL-V7R1M0  5770-WDS
000000161025     A  33                                  SFLNXTCHG
000000161025     A            OPT01          1Y 0B  6  3
000000161025     A  34                                  DSPATR(RI)
000000161025     A  34                                  DSPATR(PC)
000000161025     A                                      EDTCDE(Z)
000000161025     A            COID      R        O  6  5REFFLD(COID COUNTRY)
000000161025     A            COUNTR    R        O  6  9REFFLD(COUNTR COUNTRY)
000000161025     A          R CTL01                     SFLCTL(SFL01)
000000161025     A*%%TS  SD  20161025  135749  VTAQUIN     REL-V7R1M0  5770-WDS
000000161025     A                                      SFLSIZ(0011)
000000161025     A                                      SFLPAG(0010)
000000161025     A                                      WINDOW(KEY01)
000000161025     A                                      CF08(08)
000000161025     A N80                                  PAGEDOWN(25 'dynamic subfile')
000000161025     A                                      OVERLAY
000000161025     A  31                                  SFLDSP
000000161025     A  32                                  SFLDSPCTL
000000161025     A  30                                  SFLCLR
000000161025     A  80                                  SFLEND(*MORE)
000000161025     A  35                                  SFLMSG('INVALID OPTION' 35)
000000161025     A  36                                  SFLMSG('ONLY ONE SELECTION' 36)
000000161025     A            RRB01          4S 0H      SFLRCDNBR
000000161025     A                                  1 22'Select a Country Code'
000000161025     A                                      DSPATR(HI)
000000161025     A                                  2  2'Make a selection. Press Enter'
000000161025     A                                      COLOR(BLU)
000000161025     A                                  3  3'1=Select'
000000161025     A                                      COLOR(BLU)
000000161025     A                                  4  2'Opt'
000000161025     A                                      DSPATR(HI)
000000161025     A            OPTC1          1Y 0B  5  3EDTCDE(Z)
000000161025     A  41                                  ERRMSG('Invalid option' 41)
000000161025     A  42                                  ERRMSG('Position to not available w-
000000161025     A                                      ith selection pending' 42)
000000161025     A                                  3 19'8=Position to'
000000161025     A                                      COLOR(BLU)
000000161025     A                                  4  6'Code'
000000161025     A                                      DSPATR(HI)
000000161025     A                                  4 13'Description'
000000161025     A                                      DSPATR(HI)
000000161025     A            POSCOD    R        B  5  5REFFLD(COID COUNTRY)
000000161025     A  40                                  DSPATR(ND)
000000161025     A  40                                  DSPATR(PR)
000000161025     A                                  1  1'COU301'
000000161025     A                                      COLOR(BLU)
000000161025     A            POSDES    R        B  5  9REFFLD(COUNTR COUNTRY)
000000161025     A N40                                  DSPATR(ND)
000000161025     A N40                                  DSPATR(PR)
000000161025     A                                      CHECK(LC)
000000161025     A          R KEY01
000000161025     A*%%TS  SD  20161025  135749  VTAQUIN     REL-V7R1M0  5770-WDS
000000161025     A                                      OVERLAY
000000161025     A                                      WINDOW(4 25 18 42)
000000161025     A                                 17  2'F3=Exit'
000000161025     A                                      COLOR(BLU)
000000161025     A  40                             17 14'F8=By code'
000000161025     A                                      COLOR(BLU)
000000161025     A N40                             17 14'F8=By desc.'
000000161025     A                                      COLOR(BLU)
000000161025     A                                 17 27'F12=Cancel'
000000161025     A                                      COLOR(BLU)
