000000221013     A*%%EC
000000221013     A                                      DSPSIZ(24 80 *DS3)
000000221013     A                                      REF(*LIBL/CUSTOMER FCUST)
000000221013     A                                      PRINT
000000221013     A                                      INDARA
000000221013     A                                      ERRSFL
000000221013     A                                      CA03(03)
000000221013     A                                      CA12(12)
000000210330     A          R FMT01
000000210330     A*%%TS  SD  20210330  105750  VTAQUIN     REL-V7R3M0  5770-WDS
000000210330     A                                      CF04(04 'Prompt')
000000210330     A                                  1  2'CUS250 '
000000210330     A                                      COLOR(BLU)
000000210330     A                                  3  4'Type choices, press Enter.'
000000210330     A                                      COLOR(BLU)
000000210330     A                                 23  3'F3=Exit'
000000210330     A                                      COLOR(BLU)
000000210330     A                                 23 33'F12=Cancel'
000000210330     A                                      COLOR(BLU)
000000210330     A                                  1 34'Customer by Id'
000000210330     A                                      DSPATR(HI)
000000210330     A                                  5  4'Customer Id . . . . . .'
000000210330     A            CUID      R        B  5 29
000000210331     A  40                                  ERRMSGID(ERR0103 *LIBL/SAMMSGF 40 &-
000000210331     A                                      ERRDATA)
000000210331     A            ERRDATA        6A  P
000000210330     A                                 23 17'F4=Prompt'
000000210330     A                                      COLOR(BLU)
000000221013     A          R FMT02
000000221013     A*%%TS  SD  20221013  160157  VTAQUIN     REL-V7R3M0  5770-WDS
000000221013     A                                  1  2'CUS250 '
000000221013     A                                      COLOR(BLU)
000000221013     A                                  3  4'Press Enter to continue.'
000000221013     A                                      COLOR(BLU)
000000221013     A                                 23  3'F3=Exit'
000000221013     A                                      COLOR(BLU)
000000221013     A                                 23 19'F12=Cancel'
000000221013     A                                      COLOR(BLU)
000000221013     A                                  5  4'Customer Id . . . . . :'
000000221013     A                                  6  4'Name  . . . . . . . . :'
000000221013     A                                  7  4'Phone . . . . . . . . :'
000000221013     A                                  8  4'Vat Nr  . . . . . . . :'
000000221013     A                                  9  4'Category  . . . . . . :'
000000221013     A                                 10  4'eMail . . . . . . . . :'
000000221013     A                                 11  4'Address . . . . . . . :'
000000221013     A                                 14  4'Postal Code & City  . :'
000000221013     A                                 15  4'Country Code  . . . . :'
000000221013     A                                 16  4'Credit Limit  . . . . :'
000000221013     A                                 17  4'Current Credit  . . . :'
000000221013     A                                 18  4'Last Order Date . . . :'
000000221013     A                                  1 34'Customer by Id'
000000221013     A                                      DSPATR(HI)
000000221013     A            CUID      R        O  5 29
000000221013     A            CUSTNM    R        O  6 29
000000221013     A            CUPHONE   R        O  7 29
000000221013     A            CUVAT     R        O  8 29
000000221013     A            CUMAIL    R        O 10 29
000000221013     A            CULINE1   R        O 11 29
000000221013     A            CULINE2   R        O 12 29
000000221013     A            CULINE3   R        O 13 29
000000221013     A            CUZIP     R        O 14 29
000000221013     A            CUCITY    R        O 14 40
000000221013     A            CUCOUN    R        O 15 29
000000221013     A            CUCREDIT  R        O 16 29EDTCDE(J)
000000221013     A            CULIMCRE  R        O 17 29EDTCDE(J)
000000221013     A            CULASTORD R        O 18 29
000000221013     A            COUNTR    R        O 15 32REFFLD(FCOUN/COUNTR *LIBL/COUNTRY)
000000221013     A            CUCAT     R        O  9 29
000000221013     A            CATNAME       30   O  9 32
