000000221013     A*%%TS  SD  20221013  112133  VTAQUIN     REL-V7R3M0  5770-WDS
000000221013     A*%%EC
000000221013     A                                      DSPSIZ(24 80 *DS3)
000000221013     A                                      INDARA
000000221013     A                                      CA03(03)
000000221013     A                                      CA12(12)
000000221013     A                                      PRINT
000000221013     A                                      ERRSFL
000000221013     A          R SFL01                     SFL
000000221013     A*%%TS  SD  20221013  110729  VTAQUIN     REL-V7R3M0  5770-WDS
000000221013     A  33                                  SFLNXTCHG
000000221013     A            OPT01          2Y 0B  7  3
000000221013     A  34                                  DSPATR(RI)
000000221013     A  34                                  DSPATR(PC)
000000221013     A                                      EDTCDE(Z)
000000221013     A            CUID      R        O  7  7REFFLD(FCUST/CUID *LIBL/CUSTOMER)
000000221013     A            CUSTNM    R        O  7 13REFFLD(FCUST/CUSTNM *LIBL/CUSTOMER)
000000221013     A            CUCITY    R        O  8 13REFFLD(FCUST/CUCITY *LIBL/CUSTOMER)
000000221013     A            CUDEL     R        O  7 75REFFLD(FCUST/CUDEL *LIBL/CUSTOMER)
000000221013     A            CULIMCRE  R        O  7 59REFFLD(FCUST/CULIMCRE *LIBL/CUSTOME-
000000221013     A                                      R)
000000221013     A                                      EDTCDE(2)
000000221013     A            CUZIP     R        O  7 44REFFLD(FCUST/CUZIP *LIBL/CUSTOMER)
000000221013     A            CUCAT     R        O  7 55REFFLD(FCUST/CUCAT *LIBL/CUSTOMER)
000000221013     A          R CTL01                     SFLCTL(SFL01)
000000221013     A*%%TS  SD  20221013  110729  VTAQUIN     REL-V7R3M0  5770-WDS
000000221013     A                                      SFLSIZ(0015)
000000221013     A                                      SFLPAG(0007)
000000221013     A N80                                  PAGEDOWN(25 'dynamic subfile')
000000221013     A                                      CA05(05 'Refresh')
000000221013     A                                      CF06(06 'Create')
000000221013     A                                      CA13(13 'Get privilege')
000000221013     A                                      OVERLAY
000000221013     A  31                                  SFLDSP
000000221013     A  32                                  SFLDSPCTL
000000221013     A  30                                  SFLCLR
000000221013     A  80                                  SFLEND(*MORE)
000000221013     A                                      SFLDROP(CF11)
000000221013     A  35                                  SFLMSG('Invalid Option' 35)
000000221013     A            RRB01          4S 0H      SFLRCDNBR
000000221013     A                                  1  2'CUS200-1'
000000221013     A                                      COLOR(BLU)
000000221013     A                                  3  4'Type options, press Enter.'
000000221013     A                                      COLOR(BLU)
000000221013     A                                  6  3'Opt'
000000221013     A                                      DSPATR(HI)
000000221013     A                                  1 31'Work with Customers'
000000221013     A                                      DSPATR(HI)
000000221013     A                                  1 70DATE
000000221013     A                                      EDTCDE(Y)
000000221013     A                                  2 70TIME
000000221013     A  50                              4  6'2=Edit'
000000221013     A                                      COLOR(BLU)
000000221013     A                                  4 17'5=Display'
000000221013     A                                      COLOR(BLU)
000000221013     A                                  6  7'Id'
000000221013     A                                      DSPATR(HI)
000000221013     A                                  6 13'Customer/City'
000000221013     A                                      DSPATR(HI)
000000221013     A                                  6 44'ZIP Code'
000000221013     A                                      DSPATR(HI)
000000221013     A                                  6 74'Del'
000000221013     A                                      DSPATR(HI)
000000221013     A                                  2  4'Position to name . .'
000000221013     A                                      COLOR(BLU)
000000221013     A            POSTO         10A  B  2 27CHECK(LC)
000000221013     A                                  5 62'Credit'
000000221013     A                                      DSPATR(HI)
000000221013     A                                  6 63'Limit'
000000221013     A                                      DSPATR(HI)
000000221013     A                                  6 55'Cat'
000000221013     A                                      DSPATR(HI)
000000221013     A                                  4 31'6=Orders'
000000221013     A                                      COLOR(BLU)
000000221012     A          R KEY01
000000221012     A*%%TS  SD  20221012  164214  VTAQUIN     REL-V7R3M0  5770-WDS
000000221012     A                                 23  3'F3=Exit'
000000221012     A                                      COLOR(BLU)
000000221012     A                                 23 67'F12=Cancel'
000000221012     A                                      COLOR(BLU)
000000221012     A                                 23 15'F5=Refresh'
000000221012     A                                      COLOR(BLU)
000000221012     A                                 23 32'F6=Create'
000000221012     A                                      COLOR(BLU)
000000221012     A                                 23 46'F11=More Info'
000000221012     A                                      COLOR(BLU)
000000221012     A                                 23 63'F13=Get Privilege'
000000221012     A                                      COLOR(BLU)
000000221013     A          R FMT02
000000221013     A*%%TS  SD  20221013  110729  VTAQUIN     REL-V7R3M0  5770-WDS
000000221013     A                                      CF04(04)
000000221013     A                                  1  2'CUS200-2'
000000221013     A                                      COLOR(BLU)
000000221013     A                                  3  4'Type choices, press Enter.'
000000221013     A                                      COLOR(BLU)
000000221013     A                                 23  3'F3=Exit'
000000221013     A                                      COLOR(BLU)
000000221013     A                                 23 19'F12=Cancel'
000000221013     A                                      COLOR(BLU)
000000221013     A                                  1 34'Edit Customer'
000000221013     A                                      DSPATR(HI)
000000221013     A                                  1 70DATE
000000221013     A                                      EDTCDE(Y)
000000221013     A                                      COLOR(BLU)
000000221013     A                                  2 70TIME
000000221013     A                                      COLOR(BLU)
000000221013     A                                  5  3'Customer Id . . . . . :'
000000221013     A                                  6  3'Name  . . . . . . . . .'
000000221013     A            CUID      R        O  5 27REFFLD(FCUST/CUID *LIBL/CUSTOMER)
000000221013     A            CUSTNM    R        B  6 27REFFLD(FCUST/CUSTNM *LIBL/CUSTOMER)
000000221013     A  41                                  ERRMSG('The name is mandatory' 41)
000000221013     A  42                                  ERRMSGID(ERR2000 *LIBL/SAMMSGF 42 &-
000000221013     A                                      ERRDATA)
000000221013     A                                      CHECK(LC)
000000221013     A            ERRDATA       45A  P
000000221013     A                                  7  3'Phone . . . . . . . . .'
000000221013     A                                  8  3'Vat N°  . . . . . . . .'
000000221013     A                                 10  3'eMail . . . . . . . . .'
000000221013     A            CUMAIL    R        B 10 27REFFLD(FCUST/CUMAIL *LIBL/CUSTOMER)
000000221013     A            CUPHONE   R        B  7 27REFFLD(FCUST/CUPHONE *LIBL/CUSTOMER)
000000221013     A  43                                  ERRMSGID(ERR2001 *LIBL/SAMMSGF 43)
000000221013     A  44                                  ERRMSGID(ERR2002 *LIBL/SAMMSGF 44)
000000221013     A            CUVAT     R        B  8 27REFFLD(FCUST/CUVAT *LIBL/CUSTOMER)
000000221013     A                                 11  3'Address . . . . . . . .'
000000221013     A            CULINE1   R        B 11 27REFFLD(FCUST/CULINE1 *LIBL/CUSTOMER)
000000221013     A                                      CHECK(LC)
000000221013     A            CULINE2   R        B 12 27REFFLD(FCUST/CULINE2 *LIBL/CUSTOMER)
000000221013     A                                      CHECK(LC)
000000221013     A            CULINE3   R        B 13 27REFFLD(FCUST/CULINE3 *LIBL/CUSTOMER)
000000221013     A                                      CHECK(LC)
000000221013     A            CUZIP     R        B 14 27REFFLD(FCUST/CUZIP *LIBL/CUSTOMER)
000000221013     A  50                                  DSPATR(PR)
000000221013     A            CUCITY    R        B 14 39REFFLD(FCUST/CUCITY *LIBL/CUSTOMER)
000000221013     A                                      CHECK(LC)
000000221013     A  50                                  DSPATR(PR)
000000221013     A                                 14  3'Postal Code & City  . .'
000000221013     A                                 15  3'Country Code  . . . . .'
000000221013     A            CUCOUN    R        B 15 27REFFLD(FCUST/CUCOUN *LIBL/CUSTOMER)
000000221013     A  40                                  ERRMSGID(ERR0002 *LIBL/SAMMSGF 40)
000000221013     A  50                                  DSPATR(PR)
000000221013     A                                 16  3'Credit Limit  . . . . .'
000000221013     A                                 17  3'Current Credit  . . . :'
000000221013     A            CULIMCRE  R        B 16 27REFFLD(FCUST/CULIMCRE *LIBL/CUSTOME-
000000221013     A                                      R)
000000221013     A                                      EDTCDE(2)
000000221013     A            CUCREDIT  R        O 17 27REFFLD(FCUST/CUCREDIT *LIBL/CUSTOME-
000000221013     A                                      R)
000000221013     A                                      EDTCDE(2)
000000221013     A            CONAME        30   O 15 31
000000221013     A            MODE           3A  O  3 70
000000221013     A                                 18  3'Last Order Date . . . :'
000000221013     A            LASTORD         L  B 18 27DATFMT(*JOB)
000000221013     A                                      MAPVAL(('1940-01-01' *BLANK))
000000221013     A                                  9  3'Category  . . . . . . .'
000000221013     A            CUCAT     R        B  9 27REFFLD(FCUST/CUCAT *LIBL/CUSTOMER)
000000221013     A  45                                  ERRMSG('Invalid category' 45)
000000221013     A            CATNAME       30   O  9 31
000000221013     A          R WDW01
000000221013     A*%%TS  SD  20221013  112133  VTAQUIN     REL-V7R3M0  5770-WDS
000000221013     A                                      WINDOW(7 10 9 60)
000000221013     A                                  1 15'Get Privilege'
000000221013     A                                      DSPATR(HI)
000000221013     A                                  2  2'Type choice. Press Enter.'
000000221013     A                                      COLOR(BLU)
000000221013     A                                  4  2'Password . . . .'
000000221013     A            PASSWORD      10   I  4 21DSPATR(ND)
000000221013     A  46                                  ERRMSG('Invalid Password' 46)
000000221013     A                                  5  2'The password is ARCAD. This is jus-
000000221013     A                                      t a demo !'
000000221013     A                                  8  2'F12=Cancel'
000000221013     A                                      COLOR(BLU)
000000221013     A          R FMT03
000000221013     A*%%TS  SD  20221013  110729  VTAQUIN     REL-V7R3M0  5770-WDS
000000221013     A                                      CF04(04)
000000221013     A                                  1  2'CUS200-3'
000000221013     A                                      COLOR(BLU)
000000221013     A                                 23  3'F3=Exit'
000000221013     A                                      COLOR(BLU)
000000221013     A                                 23 19'F12=Cancel'
000000221013     A                                      COLOR(BLU)
000000221013     A                                  1 70DATE
000000221013     A                                      EDTCDE(Y)
000000221013     A                                      COLOR(BLU)
000000221013     A                                  2 70TIME
000000221013     A                                      COLOR(BLU)
000000221013     A                                  5  3'Customer Id . . . . . :'
000000221013     A                                  6  3'Name  . . . . . . . . .'
000000221013     A            CUID      R        O  5 27REFFLD(FCUST/CUID *LIBL/CUSTOMER)
000000221013     A            CUSTNM    R        O  6 27REFFLD(FCUST/CUSTNM *LIBL/CUSTOMER)
000000221013     A                                  7  3'Phone . . . . . . . . .'
000000221013     A                                  8  3'Vat N°  . . . . . . . .'
000000221013     A                                 10  3'eMail . . . . . . . . .'
000000221013     A            CUMAIL    R        O 10 27REFFLD(FCUST/CUMAIL *LIBL/CUSTOMER)
000000221013     A            CUPHONE   R        O  7 27REFFLD(FCUST/CUPHONE *LIBL/CUSTOMER)
000000221013     A            CUVAT     R        O  8 27REFFLD(FCUST/CUVAT *LIBL/CUSTOMER)
000000221013     A                                 11  3'Address . . . . . . . .'
000000221013     A            CULINE1   R        O 11 27REFFLD(FCUST/CULINE1 *LIBL/CUSTOMER)
000000221013     A            CULINE2   R        O 12 27REFFLD(FCUST/CULINE2 *LIBL/CUSTOMER)
000000221013     A            CULINE3   R        O 13 27REFFLD(FCUST/CULINE3 *LIBL/CUSTOMER)
000000221013     A            CUZIP     R        O 14 27REFFLD(FCUST/CUZIP *LIBL/CUSTOMER)
000000221013     A            CUCITY    R        O 14 39REFFLD(FCUST/CUCITY *LIBL/CUSTOMER)
000000221013     A                                 14  3'Postal Code & City  . .'
000000221013     A                                 15  3'Country Code  . . . . .'
000000221013     A            CUCOUN    R        O 15 27REFFLD(FCUST/CUCOUN *LIBL/CUSTOMER)
000000221013     A                                 16  3'Credit Limit  . . . . .'
000000221013     A                                 17  3'Current Credit  . . . :'
000000221013     A            CULIMCRE  R        O 16 27REFFLD(FCUST/CULIMCRE *LIBL/CUSTOME-
000000221013     A                                      R)
000000221013     A                                      EDTCDE(2)
000000221013     A            CUCREDIT  R        O 17 27REFFLD(FCUST/CUCREDIT *LIBL/CUSTOME-
000000221013     A                                      R)
000000221013     A                                      EDTCDE(2)
000000221013     A            CONAME        30   O 15 31
000000221013     A            MODE           3A  O  3 70
000000221013     A                                 18  3'Last Order Date . . . :'
000000221013     A            LASTORD         L  O 18 27DATFMT(*JOB)
000000221013     A                                      MAPVAL(('1940-01-01' *BLANK))
000000221013     A                                  9  3'Category  . . . . . . .'
000000221013     A            CUCAT     R        O  9 27REFFLD(FCUST/CUCAT *LIBL/CUSTOMER)
000000221013     A            CATNAME       30   O  9 31
000000221013     A                                  1 33'Display Customer'
000000221013     A                                      DSPATR(HI)
000000221013     A                                  3  5'Press Enter to continue.'
000000221013     A                                      COLOR(BLU)
