000000161128     A*%%TS  SD  20161128  161956  VTAQUIN     REL-V7R1M0  5770-WDS
000000161128     A*%%EC
000000161128     A                                      DSPSIZ(24 80 *DS3)
000000161128     A                                      REF(*LIBL/CUSTOMER)
000000161128     A                                      INDARA
000000161128     A                                      PRINT
000000161128     A                                      ERRSFL
000000161128     A                                      CA03(03)
000000161128     A                                      CA12(12)
000000161128     A          R SFL01                     SFL
000000161128     A*%%TS  SD  20161128  161956  VTAQUIN     REL-V7R1M0  5770-WDS
000000161128     A  33                                  SFLNXTCHG
000000161128     A            OPT01          1Y 0B  8  3
000000161128     A  34                                  DSPATR(RI)
000000161128     A  34                                  DSPATR(PC)
000000161128     A                                      EDTCDE(Z)
000000161128     A            CUID      R        O  8  5REFFLD(FCUST/CUID *LIBL/CUSTOMER)
000000161128     A            CUSTNM    R        O  8 11REFFLD(FCUST/CUSTNM *LIBL/CUSTOMER)
000000161128     A            CUCITY    R        O  8 42REFFLD(FCUST/CUCITY *LIBL/CUSTOMER)
000000161128     A            CUCOUN    R        O  8 73REFFLD(FCUST/CUCOUN *LIBL/CUSTOMER)
000000161128     A          R CTL01                     SFLCTL(SFL01)
000000161128     A*%%TS  SD  20161128  161956  VTAQUIN     REL-V7R1M0  5770-WDS
000000161128     A                                      CF08(08)
000000161128     A N80                                  PAGEDOWN(25 'dynamic subfile')
000000161128     A                                      OVERLAY
000000161128     A  31                                  SFLDSP
000000161128     A  32                                  SFLDSPCTL
000000161128     A  30                                  SFLCLR
000000161128     A  80                                  SFLEND(*MORE)
000000161128     A                                      SFLSIZ(0015)
000000161128     A                                      SFLPAG(0014)
000000161128     A  35                                  SFLMSG('INVALID OPTION' 35)
000000161128     A  36                                  SFLMSG('ONLY ONE SELECTION' 36)
000000161128     A            RRB01          4S 0H      SFLRCDNBR
000000161128     A                                  1 32'Select a Customer'
000000161128     A                                      DSPATR(HI)
000000161128     A                                  4  3'Make a selection. Press Enter'
000000161128     A                                      COLOR(BLU)
000000161128     A                                  5  5'1=Select'
000000161128     A                                      COLOR(BLU)
000000161128     A                                  7  2'Opt'
000000161128     A                                      DSPATR(HI)
000000161128     A                                  7  6'Code'
000000161128     A                                      DSPATR(HI)
000000161128     A                                  1  2'CUS301'
000000161128     A                                      COLOR(BLU)
000000161128     A                                  7 11'Name'
000000161128     A                                      DSPATR(HI)
000000161128     A                                  7 42'City'
000000161128     A                                      DSPATR(HI)
000000161128     A                                  2  3'Name contains  . . . :'
000000161128     A                                  3  3'City contains  . . . :'
000000161128     A            SRCHNAME      10   B  2 27
000000161128     A            SRCHCITY      10   B  3 27
000000161128     A          R KEY01
000000161128     A*%%TS  SD  20161128  161956  VTAQUIN     REL-V7R1M0  5770-WDS
000000161128     A                                      OVERLAY
000000161128     A                                 23  2'F3=Exit'
000000161128     A                                      COLOR(BLU)
000000161128     A  40                             23 14'F8=By code'
000000161128     A                                      COLOR(BLU)
000000161128     A                                 23 14'F12=Cancel'
000000161128     A                                      COLOR(BLU)
