000000161221     A*%%TS  SD  20161221  160008  VTAQUIN     REL-V7R1M0  5770-WDS
000000161221     A*%%EC
000000161221     A                                      DSPSIZ(24 80 *DS3)
000000161221     A                                      INDARA
000000161221     A                                      CA03(03)
000000161221     A                                      CA12(12)
000000161221     A                                      PRINT
000000161221     A                                      ERRSFL
000000161221     A          R SFL01                     SFL
000000161221     A*%%TS  SD  20161221  160008  VTAQUIN     REL-V7R1M0  5770-WDS
000000161221     A  33                                  SFLNXTCHG
000000161221     A            OPT01          2Y 0B  7  3
000000161221     A  34                                  DSPATR(RI)
000000161221     A  34                                  DSPATR(PC)
000000161221     A                                      EDTCDE(Z)
000000161221     A            ORID      R        O  7  6REFFLD(FORDE/ORID *LIBL/ORDER)
000000161221     A                                      EDTCDE(2)
000000161221     A            ORYEAR    R        O  7 14REFFLD(FORDE/ORYEAR *LIBL/ORDER)
000000161221     A                                      EDTCDE(Z)
000000161221     A            DATCLO          L  O  7 57DATFMT(*JOB)
000000161221     A                                      MAPVAL(('1940-01-01' *BLANK))
000000161221     A            SUMORD        11Y 2O  7 31EDTCDE(2)
000000161221     A            CUID      R        O  8  6REFFLD(FCUST/CUID *LIBL/CUSTOMER)
000000161221     A            CUSTNM    R        O  8 12REFFLD(FCUST/CUSTNM *LIBL/CUSTOMER)
000000161221     A            DATORD          L  O  7 19DATFMT(*JOB)
000000161221     A            DATLIV          L  O  7 46DATFMT(*JOB)
000000161221     A                                      MAPVAL(('1940-01-01' *BLANK))
000000161221     A          R CTL01                     SFLCTL(SFL01)
000000161221     A*%%TS  SD  20161221  160008  VTAQUIN     REL-V7R1M0  5770-WDS
000000161221     A                                      SFLSIZ(0015)
000000161221     A                                      SFLPAG(0007)
000000161221     A N80                                  PAGEDOWN(25 'dynamic subfile')
000000161221     A                                      CF06(06 'Create')
000000161221     A                                      CA05(05 'Refresh')
000000161221     A                                      OVERLAY
000000161221     A  31                                  SFLDSP
000000161221     A  32                                  SFLDSPCTL
000000161221     A  30                                  SFLCLR
000000161221     A  80                                  SFLEND(*MORE)
000000161221     A                                      SFLDROP(CF11)
000000161221     A  35                                  SFLMSG('Invalid Option' 35)
000000161221     A  36                                  SFLMSG('Closed order can not be edi-
000000161221     A                                      ted or deleted' 36)
000000161221     A  37                                  SFLMSG('Order whith deliveries can -
000000161221     A                                      not be deleted' 37)
000000161221     A            RRB01          4S 0H      SFLRCDNBR
000000161221     A                                  1  2'ORD200-1'
000000161221     A                                      COLOR(BLU)
000000161221     A                                  3  4'Type options, press Enter.'
000000161221     A                                      COLOR(BLU)
000000161221     A                                  6  2'Opt'
000000161221     A                                      DSPATR(HI)
000000161221     A                                  1 27'Work with Customer Orders'
000000161221     A                                      DSPATR(HI)
000000161221     A                                  1 68DATE
000000161221     A                                      EDTCDE(Y)
000000161221     A                                  2 68TIME
000000161221     A                                  4  7'2=Edit'
000000161221     A                                      COLOR(BLU)
000000161221     A                                  4 30'5=Display'
000000161221     A                                      COLOR(BLU)
000000161221     A                                  4 18'4=Delete'
000000161221     A                                      COLOR(BLU)
000000161221     A                                  4 43'6=Print'
000000161221     A                                      COLOR(BLU)
000000161221     A                                  4 56'7=Close'
000000161221     A                                      COLOR(BLU)
000000161221     A                                  6  8'Order'
000000161221     A                                      DSPATR(HI)
000000161221     A                                  6 14'Year'
000000161221     A                                      DSPATR(HI)
000000161221     A                                  6 19'Creation'
000000161221     A                                      DSPATR(HI)
000000161221     A                                  6 46'Delivery'
000000161221     A                                      DSPATR(HI)
000000161221     A                                  6 57'Close'
000000161221     A                                      DSPATR(HI)
000000161221     A                                  6 37'Value'
000000161221     A                                      DSPATR(HI)
000000161221     A                                  4 68'8=Deliver'
000000161221     A                                      COLOR(BLU)
000000161209     A          R KEY01
000000161209     A*%%TS  SD  20161209  163300  VTAQUIN     REL-V7R1M0  5770-WDS
000000161209     A                                 23  3'F3=Exit'
000000161209     A                                      COLOR(BLU)
000000161209     A                                 23 55'F12=Cancel'
000000161209     A                                      COLOR(BLU)
000000161209     A                                 23 42'F11=Detail'
000000161209     A                                      COLOR(BLU)
000000161209     A                                 23 14'F5=Refresh'
000000161209     A                                      COLOR(BLU)
000000161209     A                                 23 28'F6=Create'
000000161209     A                                      COLOR(BLU)
