000000161209     A*%%TS  SD  20161209  094544  VTAQUIN     REL-V7R1M0  5770-WDS
000000161209     A*%%EC
000000161209     A                                      DSPSIZ(24 80 *DS3)
000000161209     A                                      REF(*LIBL/PARAMETER)
000000161209     A                                      INDARA
000000161209     A                                      CA03(03)
000000161209     A                                      CA12(12)
000000161209     A                                      PRINT
000000161209     A                                      ERRSFL
000000161209     A          R SFL01                     SFL
000000161209     A*%%TS  SD  20161209  092705  VTAQUIN     REL-V7R1M0  5770-WDS
000000161209     A  33                                  SFLNXTCHG
000000161209     A            OPT01          2Y 0B  7  3
000000161209     A  34                                  DSPATR(RI)
000000161209     A  34                                  DSPATR(PC)
000000161209     A                                      EDTCDE(Z)
000000161209     A            PACODE    R        O  7  6REFFLD(FPARAM/PACODE *LIBL/PARAMETE-
000000161209     A                                      R)
000000161209     A            PASUBCODE R        O  7 17REFFLD(FPARAM/PASUBCODE *LIBL/PARAM-
000000161209     A                                      ETER)
000000161209     A            PARM1     R        O  7 28REFFLD(FPARAM/PARM1 *LIBL/PARAMETER)
000000161209     A            PARM3     R        O  7 72REFFLD(FPARAM/PARM3 *LIBL/PARAMETER)
000000161209     A            PARM5     R        O  7 77REFFLD(FPARAM/PARM5 *LIBL/PARAMETER)
000000161209     A            PARM4     R        O  7 75REFFLD(FPARAM/PARM4 *LIBL/PARAMETER)
000000161209     A            PARM2S        32   O  7 39
000000161209     A          R CTL01                     SFLCTL(SFL01)
000000161209     A*%%TS  SD  20161209  094544  VTAQUIN     REL-V7R1M0  5770-WDS
000000161209     A N80                                  PAGEDOWN(25 'dynamic subfile')
000000161209     A                                      CA05(05 'Refresh')
000000161209     A                                      CF06(06 'Create')
000000161209     A                                      OVERLAY
000000161209     A  31                                  SFLDSP
000000161209     A  32                                  SFLDSPCTL
000000161209     A  30                                  SFLCLR
000000161209     A  80                                  SFLEND(*MORE)
000000161209     A                                      SFLSIZ(0015)
000000161209     A                                      SFLPAG(0014)
000000161209     A  35                                  SFLMSG('Invalid Option' 35)
000000161209     A            RRB01          4S 0H      SFLRCDNBR
000000161209     A                                  1  2'PAR200-1'
000000161209     A                                      COLOR(BLU)
000000161209     A                                  3  4'Type options, press Enter.'
000000161209     A                                      COLOR(BLU)
000000161209     A                                  6  2'Opt'
000000161209     A                                      DSPATR(HI)
000000161209     A                                  1 31'Work with Parameters'
000000161209     A                                      DSPATR(HI)
000000161209     A                                  1 70DATE
000000161209     A                                      EDTCDE(Y)
000000161209     A                                      COLOR(BLU)
000000161209     A                                  2 70TIME
000000161209     A                                      COLOR(BLU)
000000161209     A                                  4  6'2=Edit'
000000161209     A                                      COLOR(BLU)
000000161209     A                                  4 17'4=Delete'
000000161209     A                                      COLOR(BLU)
000000161209     A                                  6  6'Code'
000000161209     A                                      DSPATR(HI)
000000161209     A                                  6 17'Sub-Code'
000000161209     A                                      DSPATR(HI)
000000161209     A                                  6 28'1'
000000161209     A                                      DSPATR(HI)
000000161209     A                                  6 39'2'
000000161209     A                                      DSPATR(HI)
000000161209     A                                  6 72'3'
000000161209     A                                      DSPATR(HI)
000000161209     A                                  6 75'4'
000000161209     A                                      DSPATR(HI)
000000161209     A                                  6 79'5'
000000161209     A                                      DSPATR(HI)
000000161209     A          R KEY01
000000161209     A*%%TS  SD  20161209  092705  VTAQUIN     REL-V7R1M0  5770-WDS
000000161209     A                                 23  3'F3=Exit'
000000161209     A                                      COLOR(BLU)
000000161209     A                                 23 34'F12=Cancel'
000000161209     A                                      COLOR(BLU)
000000161209     A                                 23 18'F6=Create'
000000161209     A                                      COLOR(BLU)
000000161209     A          R FMT02
000000161209     A*%%TS  SD  20161209  092705  VTAQUIN     REL-V7R1M0  5770-WDS
000000161209     A                                  1  2'PAR200-2'
000000161209     A                                      COLOR(BLU)
000000161209     A                                  3  4'Type choices, press Enter.'
000000161209     A                                      COLOR(BLU)
000000161209     A                                 23  3'F3=Exit'
000000161209     A                                      COLOR(BLU)
000000161209     A                                 23 19'F12=Cancel'
000000161209     A                                      COLOR(BLU)
000000161209     A                                  1 34'Edit Parameter'
000000161209     A                                      DSPATR(HI)
000000161209     A                                  1 70DATE
000000161209     A                                      EDTCDE(Y)
000000161209     A                                      COLOR(BLU)
000000161209     A                                  2 70TIME
000000161209     A                                      COLOR(BLU)
000000161209     A                                  5  3'Parameter Code  . . . :'
000000161209     A                                  6  3'parameter Sub_code  . :'
000000161209     A                                  7  3'Parameter 1 . . . . . .'
000000161209     A                                  8  3'Parameter 2 . . . . . .'
000000161209     A                                 10  3'Parameter 3 . . . . . .'
000000161209     A                                 11  3'Parameter 4 . . . . . .'
000000161209     A                                 12  3'Parameter 5 . . . . . .'
000000161209     A            PACODE    R        O  5 27REFFLD(FPARAM/PACODE *LIBL/PARAMETE-
000000161209     A                                      R)
000000161209     A            PASUBCODE R        O  6 27REFFLD(FPARAM/PASUBCODE *LIBL/PARAM-
000000161209     A                                      ETER)
000000161209     A            PARM1     R        B  7 27REFFLD(FPARAM/PARM1 *LIBL/PARAMETER)
000000161209     A            PARM2     R        B  8 27REFFLD(FPARAM/PARM2 *LIBL/PARAMETER)
000000161209     A                                      CHECK(LC)
000000161209     A            PARM3     R        B 10 27REFFLD(FPARAM/PARM3 *LIBL/PARAMETER)
000000161209     A            PARM4     R        B 11 27REFFLD(FPARAM/PARM4 *LIBL/PARAMETER)
000000161209     A            PARM5     R        B 12 27REFFLD(FPARAM/PARM5 *LIBL/PARAMETER)
000000161209     A          R FMT03
000000161209     A*%%TS  SD  20161209  092705  VTAQUIN     REL-V7R1M0  5770-WDS
000000161209     A                                  1  2'PAR200-3'
000000161209     A                                      COLOR(BLU)
000000161209     A                                  3  4'Type choices, press Enter.'
000000161209     A                                      COLOR(BLU)
000000161209     A                                 23  3'F3=Exit'
000000161209     A                                      COLOR(BLU)
000000161209     A                                 23 19'F12=Cancel'
000000161209     A                                      COLOR(BLU)
000000161209     A                                  1 33'Create Parameter'
000000161209     A                                      DSPATR(HI)
000000161209     A                                  1 70DATE
000000161209     A                                      EDTCDE(Y)
000000161209     A                                      COLOR(BLU)
000000161209     A                                  2 70TIME
000000161209     A                                      COLOR(BLU)
000000161209     A                                  5  3'Parameter Code  . . . .'
000000161209     A                                  6  3'parameter Sub_code  . .'
000000161209     A                                  7  3'Parameter 1 . . . . . .'
000000161209     A                                  8  3'Parameter 2 . . . . . .'
000000161209     A                                 10  3'Parameter 3 . . . . . .'
000000161209     A                                 11  3'Parameter 4 . . . . . .'
000000161209     A                                 12  3'Parameter 5 . . . . . .'
000000161209     A            PACODE    R        B  5 27REFFLD(FPARAM/PACODE *LIBL/PARAMETE-
000000161209     A                                      R)
000000161209     A  40                                  ERRMSG('This code/sub-code already -
000000161209     A                                      exist.' 40)
000000161209     A            PASUBCODE R        B  6 27REFFLD(FPARAM/PASUBCODE *LIBL/PARAM-
000000161209     A                                      ETER)
000000161209     A            PARM1     R        B  7 27REFFLD(FPARAM/PARM1 *LIBL/PARAMETER)
000000161209     A            PARM2     R        B  8 27REFFLD(FPARAM/PARM2 *LIBL/PARAMETER)
000000161209     A                                      CHECK(LC)
000000161209     A            PARM3     R        B 10 27REFFLD(FPARAM/PARM3 *LIBL/PARAMETER)
000000161209     A            PARM4     R        B 11 27REFFLD(FPARAM/PARM4 *LIBL/PARAMETER)
000000161209     A            PARM5     R        B 12 27REFFLD(FPARAM/PARM5 *LIBL/PARAMETER)
