000000210414     A*%%TS  SD  20210414  103200  VTAQUIN     REL-V7R3M0  5770-WDS
000000210414     A*%%EC
000000210414     A                                      DSPSIZ(24 80 *DS3)
000000210414     A                                      REF(*LIBL/PROVIDER FPROV)
000000210414     A                                      PRINT
000000210414     A                                      INDARA
000000210414     A                                      ERRSFL
000000210414     A                                      CA03(03)
000000210414     A                                      CA12(12)
000000210330     A          R FMT01
000000210330     A*%%TS  SD  20210330  110722  VTAQUIN     REL-V7R3M0  5770-WDS
000000210330     A                                      CF04(04 'Prompt')
000000210330     A                                  1  2'PRO250 '
000000210330     A                                      COLOR(BLU)
000000210330     A                                  3  4'Type choices, press Enter.'
000000210330     A                                      COLOR(BLU)
000000210330     A                                 23  3'F3=Exit'
000000210330     A                                      COLOR(BLU)
000000210330     A                                 23 37'F12=Cancel'
000000210330     A                                      COLOR(BLU)
000000210330     A                                  1 34'Provider by Id'
000000210330     A                                      DSPATR(HI)
000000210330     A                                  5  4'Provider Id . . . . . .'
000000210330     A                                 23 19'F4=Prompt'
000000210330     A                                      COLOR(BLU)
000000210330     A            PRID      R        B  5 29
000000210331     A  40                                  ERRMSGID(ERR0103 *LIBL/SAMMSGF 40 &-
000000210331     A                                      ERRDATA)
000000210331     A            ERRDATA        6A  P
000000210414     A          R FMT02
000000210414     A*%%TS  SD  20210414  103200  VTAQUIN     REL-V7R3M0  5770-WDS
000000210414     A                                      CA07(07 'Items')
000000210414     A                                  1  2'PRO250 '
000000210414     A                                      COLOR(BLU)
000000210414     A                                  3  4'Press Enter to continue.'
000000210414     A                                      COLOR(BLU)
000000210414     A                                 23  3'F3=Exit'
000000210414     A                                      COLOR(BLU)
000000210414     A                                 23 37'F12=Cancel'
000000210414     A                                      COLOR(BLU)
000000210414     A                                  5  4'Provider Id . . . . . :'
000000210414     A                                  6  4'Name  . . . . . . . . :'
000000210414     A                                  7  4'Phone . . . . . . . . :'
000000210414     A                                  8  4'Vat Nr  . . . . . . . :'
000000210414     A                                  9  4'eMail . . . . . . . . :'
000000210414     A                                 10  4'Address . . . . . . . :'
000000210414     A                                 13  4'Postal Code & City  . :'
000000210414     A                                 14  4'Country Code  . . . . :'
000000210414     A                                  1 34'Provider by Id'
000000210414     A                                      DSPATR(HI)
000000210414     A            PRID      R        O  5 29
000000210414     A            PROVNM    R        O  6 29
000000210414     A            PRPHONE   R        O  7 29
000000210414     A            PRVAT     R        O  8 29
000000210414     A            PRMAIL    R        O  9 29
000000210414     A            PRLINE1   R        O 10 29
000000210414     A            PRLINE2   R        O 11 29
000000210414     A            PRLINE3   R        O 12 29
000000210414     A            PRZIP     R        O 13 29
000000210414     A            PRCOUN    R        O 14 29
000000210414     A            PRCITY    R        O 13 40
000000210414     A            COUNTR    R        O 14 32REFFLD(FCOUN/COUNTR *LIBL/COUNTRY)
000000210414     A                                 23 18'F7=Items'
000000210414     A                                      COLOR(BLU)
