000000210330     A*%%TS  SD  20210330  120112  VTAQUIN     REL-V7R3M0  5770-WDS
000000210330     A*%%EC
000000210330     A                                      DSPSIZ(24 80 *DS3)
000000210330     A                                      REF(*LIBL/PROVIDER)
000000210330     A                                      INDARA
000000210330     A                                      PRINT
000000210330     A                                      ERRSFL
000000210330     A                                      CA03(03)
000000210330     A                                      CA12(12)
000000210330     A          R SFL01                     SFL
000000210330     A*%%TS  SD  20210330  120112  VTAQUIN     REL-V7R3M0  5770-WDS
000000210330     A  33                                  SFLNXTCHG
000000210330     A            OPT01          1Y 0B  8  3
000000210330     A  34                                  DSPATR(RI)
000000210330     A  34                                  DSPATR(PC)
000000210330     A                                      EDTCDE(Z)
000000210330     A            PRID      R        O  8  5REFFLD(FPROV/PRID *LIBL/PROVIDER)
000000210330     A            PROVNM    R        O  8 11REFFLD(FPROV/PROVNM *LIBL/PROVIDER)
000000210330     A            PRCITY    R        O  8 42REFFLD(FPROV/PRCITY *LIBL/PROVIDER)
000000210330     A            PRCOUN    R        O  8 73REFFLD(FPROV/PRCOUN *LIBL/PROVIDER)
000000210330     A          R CTL01                     SFLCTL(SFL01)
000000210330     A*%%TS  SD  20210330  120112  VTAQUIN     REL-V7R3M0  5770-WDS
000000210330     A                                      SFLSIZ(0015)
000000210330     A                                      SFLPAG(0014)
000000210330     A                                      CF08(08)
000000210330     A N80                                  PAGEDOWN(25 'dynamic subfile')
000000210330     A                                      OVERLAY
000000210330     A  31                                  SFLDSP
000000210330     A  32                                  SFLDSPCTL
000000210330     A  30                                  SFLCLR
000000210330     A  80                                  SFLEND(*MORE)
000000210330     A  35                                  SFLMSG('INVALID OPTION' 35)
000000210330     A  36                                  SFLMSG('ONLY ONE SELECTION' 36)
000000210330     A            RRB01          4S 0H      SFLRCDNBR
000000210330     A                                  1 32'Select a Provider'
000000210330     A                                      DSPATR(HI)
000000210330     A                                  4  3'Make a selection. Press Enter'
000000210330     A                                      COLOR(BLU)
000000210330     A                                  5  5'1=Select'
000000210330     A                                      COLOR(BLU)
000000210330     A                                  7  2'Opt'
000000210330     A                                      DSPATR(HI)
000000210330     A                                  7  6'Code'
000000210330     A                                      DSPATR(HI)
000000210330     A                                  1  2'PRO301'
000000210330     A                                      COLOR(BLU)
000000210330     A                                  7 11'Name'
000000210330     A                                      DSPATR(HI)
000000210330     A                                  7 42'City'
000000210330     A                                      DSPATR(HI)
000000210330     A                                  2  3'Name contains  . . . :'
000000210330     A                                  3  3'City contains  . . . :'
000000210330     A            SRCHNAME      10A  B  2 27
000000210330     A            SRCHCITY      10A  B  3 27
000000161128     A          R KEY01
000000161128     A*%%TS  SD  20161128  161956  VTAQUIN     REL-V7R1M0  5770-WDS
000000161128     A                                      OVERLAY
000000161128     A                                 23  2'F3=Exit'
000000161128     A                                      COLOR(BLU)
000000161128     A  40                             23 14'F8=By code'
000000161128     A                                      COLOR(BLU)
000000161128     A                                 23 14'F12=Cancel'
000000161128     A                                      COLOR(BLU)
